In [1]:
import pandas as pd
import numpy as np

In [4]:
df_limpieza = pd.read_csv('hr_raw_data_final.csv', index_col=0)

In [5]:
df_limpieza.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1678 non-null   object
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeecount             1678 non-null   int64
 9   employeenumber            1678 non-null   int64
 10  environmentsatisfaction   1678 non-null   int64
 11  gender                    1678 non-null   int64
 12  hourlyrate                411 non-null    float64
 13  jobinvolvement            1678 non-null   int64
 14  joblevel                  1678 non-null   int64
 15  jobrole                   1678 non-null   object
 16  jobsatisfaction           1678 non-null   int64
 17  maritalstatus             1003 non-null   object
 18  monthlyincome             1189 non-null   object
 19  monthlyrate               1678 non-null   object
 20  numcompaniesworked        1678 non-null   int64
 21  over18                    740 non-null    object
 22  overtime                  982 non-null    object
 23  percentsalaryhike         1678 non-null   int64
 24  performancerating         1478 non-null   object
 25  relationshipsatisfaction  1678 non-null   int64
 26  standardhours             1327 non-null   object
 27  stockoptionlevel          1678 non-null   int64
 28  totalworkingyears         1129 non-null   object
 29  trainingtimeslastyear     1678 non-null   int64
 30  worklifebalance           1564 non-null   object
 31  yearsatcompany            1678 non-null   int64
 32  yearsincurrentrole        35 non-null     object
 33  yearssincelastpromotion   1678 non-null   int64
 34  yearswithcurrmanager      1678 non-null   int64
 35  sameasmonthlyincome       1189 non-null   object
 36  datebirth                 1678 non-null   int64
 37  salary                    1393 non-null   object
 38  roledepartament           312 non-null    object
 39  numberchildren            0 non-null      float64
 40  remotework                1678 non-null   object
dtypes: float64(3), int64(18), object(20)
memory usage: 550.6+ KB

In [17]:
def eliminar_columnas(df, nombre_columna):
    df_drop = df.drop(nombre_columna, axis=1, inplace=True) # hay que asignarle una variable para que lo guarde. Comprobado que funciona, cambiamos el inplace por True.
    print(f'La columna {nombre_columna} se ha eliminado correctamente.')
    return df_drop.head(1)

In [18]:
eliminar_columnas(df_limpieza, 'numberchildren')

La columna numberchildren se ha eliminado correctamente.

AttributeError: 'NoneType' object has no attribute 'head'

In [19]:
df_limpieza.head()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,...,"3,0",20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,...,"3,0",33,NaN,11,9,NaN,1971,"199990,00$",NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,...,NaN,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,...,NaN,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,...,"3,0",19,NaN,2,8,"12783,92$",1977,NaN,NaN,0

In [20]:
df_limpieza.head()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,...,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,...,"3,0",20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,...,"3,0",33,NaN,11,9,NaN,1971,"199990,00$",NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,...,NaN,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,...,NaN,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,...,"3,0",19,NaN,2,8,"12783,92$",1977,NaN,NaN,0